#Область СлужебныеПроцедурыИФункции

#Область ДанныеСопоставленияНоменклатуры

Функция ТекстЗапросаДанныеНоменклатуры() Экспорт
	
	ТекстЗапроса = "";
	РаботаСНоменклатуройПереопределяемый.ИнициализацияЗапросаОтбораДанныхНоменклатуры(ТекстЗапроса);
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	ЗапросПакета = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() -1];
	Колонка = ЗапросПакета.Колонки.Найти("Номенклатура");
	
	Если Колонка = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'В запросе отсутствует обязательная колонка ""Номенклатура"".'");
	КонецЕсли;
	
	ИндексКолонки = ЗапросПакета.Колонки.Индекс(Колонка);
	
	Для Каждого ОператорыЗапроса Из ЗапросПакета.Операторы Цикл
		
		ТекстОтбора = СтрШаблон("%1 = &Номенклатура", ОператорыЗапроса.ВыбираемыеПоля[ИндексКолонки]);
		ОператорыЗапроса.Отбор.Добавить(ТекстОтбора);
		
	КонецЦикла;
	
	Возврат СхемаЗапроса.ПолучитьТекстЗапроса();
	
КонецФункции

#КонецОбласти

#КонецОбласти