////////////////////////////////////////////////////////////////////////////////
// Подсистема "Торговые предложения".
// ОбщийМодуль.ТорговыеПредложения.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область СобытияФормыПубликации

// Процедура, вызываемая из обработчика события формы ПриСозданииНаСервере.
// Для формы настройки выгрузки торгового предложения программно формирует элементы
// настройки торговых предложений (гиперссылки, статус).
//
// Параметры:
//  Форма             - ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//  ЭлементИнтерфейса - ЭлементФормы - элемент формы.
//
Процедура ИнициализацияЭлементовФормы(Знач Форма, ЭлементИнтерфейса) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОбменБизнесСеть") Тогда
		Возврат;
	КонецЕсли;
	
	ТипТорговоеПредложение = Метаданные.ОпределяемыеТипы.ТорговоеПредложение.Тип;
	Если ТипТорговоеПредложение.СодержитТип(ТипЗнч(Форма.Объект.Ссылка)) Тогда
		
		Если Не ПравоНастройкиТорговыхПредложений() Тогда
			Возврат;
		КонецЕсли;
		
		ДобавитьЭлементыУправленияФормыТорговыеПредложения(Форма, ЭлементИнтерфейса);
		ДекорацияФормы = Форма.Элементы.ТорговыеПредложенияСостояниеОбмена;
		
		ОбновитьДекорациюСостоянияПубликации(Форма.Объект.Ссылка, ДекорацияФормы, Форма.ТорговыеПредложенияПубликовать);
		Форма.Элементы.ТорговыеПредложенияОткрытьНастройкиПубликации.Видимость = Форма.ТорговыеПредложенияПубликовать;
		Форма.Элементы.ТорговыеПредложенияОткрытьПозицииТорговогоПредложения.Видимость = Форма.ТорговыеПредложенияПубликовать;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура обновления элемента формы состояния обмена.
// Изменяет заголовок, цвет, гиперссылку для декорации формы.
//
// Параметры:
//  Ссылка - СправочникСсылка - ссылка на определяемый тип ТорговыеПредложения.
//  ДекорацияФормы - ДекорацияФормы - элемент формы Декорация.
//  РежимПубликации - Булево - признак публикации торгового предложения.
//
Процедура ОбновитьДекорациюСостоянияПубликации(Ссылка, ДекорацияФормы, РежимПубликации = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТорговоеПредложение", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СостоянияСинхронизацииТорговыеПредложения.ДатаСинхронизации     КАК ДатаСинхронизации,
	|	СостоянияСинхронизацииТорговыеПредложения.Состояние             КАК Состояние,
	|	СостоянияСинхронизацииТорговыеПредложения.ОписаниеОшибки        КАК ОписаниеОшибки,
	|	СостоянияСинхронизацииТорговыеПредложения.ДействиеСинхронизации КАК ДействиеСинхронизации
	|ИЗ
	|	РегистрСведений.СостоянияСинхронизацииТорговыеПредложения КАК СостоянияСинхронизацииТорговыеПредложения
	|ГДЕ
	|	СостоянияСинхронизацииТорговыеПредложения.ТорговоеПредложение = &ТорговоеПредложение";
	Выборка = Запрос.Выполнить().Выбрать();
	
	РежимПубликации = Ложь;
	Если Выборка.Следующий() Тогда
		РежимПубликации = Истина;
		Если Выборка.Состояние = Перечисления.СостоянияСинхронизацииТорговыеПредложения.Синхронизировано Тогда
			ДекорацияФормы.Заголовок = СтрШаблон("%1 (%2)",
				НСтр("ru = 'Опубликовано'"),
				Формат(Выборка.ДатаСинхронизации, "ДЛФ=DT"));
			ДекорацияФормы.ЦветТекста  = ЦветаСтиля.РезультатУспехЦвет;
			ДекорацияФормы.Гиперссылка = Ложь;
		ИначеЕсли Выборка.Состояние = Перечисления.СостоянияСинхронизацииТорговыеПредложения.ТребуетсяСинхронизация Тогда
			Если Выборка.ДействиеСинхронизации = Перечисления.ДействияСинхронизацииТорговыеПредложения.Удаление Тогда
				ДекорацияФормы.Заголовок = НСтр("ru = 'Удаление публикации. Требуется синхронизация'");
				РежимПубликации          = Ложь;
			Иначе
				ДекорацияФормы.Заголовок = НСтр("ru = 'Требуется синхронизация'");
			КонецЕсли;
			ДекорацияФормы.ЦветТекста  = ЦветаСтиля.ЦветГиперссылкиБЭД;
			ДекорацияФормы.Гиперссылка = Истина;
		Иначе
			ДекорацияФормы.Заголовок   = НСтр("ru = 'Ошибка синхронизации'");
			ДекорацияФормы.ЦветТекста  = ЦветаСтиля.ПоясняющийОшибкуТекст;
			ДекорацияФормы.Гиперссылка = Истина;
		КонецЕсли;
	Иначе
		ДекорацияФормы.Заголовок = "";
	КонецЕсли;
		
КонецПроцедуры

// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма             - ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//  Источник          - СправочникОбъект - источник события.
//  Организация       - СправочникСсылка - организация торгового предложения.
//  ЭлементИнтерфейса - ЭлементФормы - группа элементов формы.
//  Отказ             - Булево - признак отказа от выполнения действия.
//
Процедура ПередЗаписьюНаСервере(Знач Форма, Знач Источник, Знач Организация, Знач ЭлементИнтерфейса, Отказ) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОбменБизнесСеть") Тогда
		Возврат;
	КонецЕсли;
	
	Если Метаданные.ОпределяемыеТипы.ТорговоеПредложение.Тип.СодержитТип(ТипЗнч(Источник.Ссылка)) Тогда
		ГруппаТорговыеПредложения = ЭлементИнтерфейса.ПодчиненныеЭлементы.Найти("ГруппаТорговыеПредложения");
		Если ГруппаТорговыеПредложения = Неопределено
			ИЛИ ГруппаТорговыеПредложения.ПодчиненныеЭлементы.Найти("ТорговыеПредложенияПубликовать") = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если Форма.ТорговыеПредложенияПубликовать Тогда
			ТекстСообщения = "";
			Если Не ЗначениеЗаполнено(Источник.Организация) Тогда
				ТекстСообщения = НСтр("ru = 'Организация не указана. Публикация торговых предложений невозможна.'");
			ИначеЕсли Не БизнесСеть.ОрганизацияПодключена(Источник.Организация) Тогда
				ТекстСообщения = СтрШаблон(
					НСтр("ru = 'Организация %1 не зарегистрирована в сервисе 1С:Бизнес-сеть. Публикация торговых предложений отменена.'"),
					Источник.Организация);
			КонецЕсли;
			Если Не ПустаяСтрока(ТекстСообщения) Тогда
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
					Источник.Ссылка, "Организация", "Объект", Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма             - ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//  ТекущийОбъект     - ОпределяемыйТип.ТорговоеПредложение - торговое предложений.
//  Организация       - ОпределяемыйТип.Организация         - организация торгового предложения.
//  ЭлементИнтерфейса - ЭлементФормы                        - группа элементов формы.
//
Процедура ПослеЗаписиНаСервере(Знач Форма, Знач ТекущийОбъект, Знач Организация, Знач ЭлементИнтерфейса = Неопределено) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОбменБизнесСеть") Тогда
		Возврат;
	КонецЕсли;

	Если Метаданные.ОпределяемыеТипы.ТорговоеПредложение.Тип.СодержитТип(ТипЗнч(ТекущийОбъект.Ссылка)) Тогда
		
		Если ЭлементИнтерфейса.ПодчиненныеЭлементы.Найти("ГруппаТорговыеПредложения") = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Источник = ТекущийОбъект.Ссылка;
		ЭлементСостояниеОбмена             = Форма.Элементы.ТорговыеПредложенияСостояниеОбмена;
		ЭлементНастройкиПубликации         = Форма.Элементы.ТорговыеПредложенияОткрытьНастройкиПубликации;
		ЭлементПозицииТорговогоПредложения = Форма.Элементы.ТорговыеПредложенияОткрытьПозицииТорговогоПредложения;
		Публиковать                        = Форма.ТорговыеПредложенияПубликовать;
		
		СостоянияСинхронизации = РегистрыСведений.СостоянияСинхронизацииТорговыеПредложения;
		Выборка = СостоянияСинхронизации.Выбрать(Новый Структура("ТорговоеПредложение", Источник));
		МенеджерЗаписи = РегистрыСведений.СостоянияСинхронизацииТорговыеПредложения.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ТорговоеПредложение = Источник;
		ЕстьЗапись = Ложь;
		Если Выборка.Следующий() Тогда
			МенеджерЗаписи.Организация = Выборка.Организация;
			МенеджерЗаписи.Прочитать();
			ЕстьЗапись = Истина;
		Иначе
			МенеджерЗаписи.Организация = Организация;
			МенеджерЗаписи.ПубликоватьЦены = Истина; // значение по умолчанию
		КонецЕсли;
		
		Если Публиковать Тогда
			Статус = НСтр("ru = 'Требуется синхронизация'");
		ИначеЕсли ЕстьЗапись Тогда
			Статус = НСтр("ru = 'Удаление публикации. Требуется синхронизация'");
		Иначе
			Статус = "";
		КонецЕсли;
		
		Если Не Публиковать И ЕстьЗапись Тогда
			Если МенеджерЗаписи.ДействиеСинхронизации = Перечисления.ДействияСинхронизацииТорговыеПредложения.Добавление Тогда // отменяем синхронизацию
				МенеджерЗаписи.Удалить();
				Статус = "";
			Иначе
				МенеджерЗаписи.ДействиеСинхронизации = Перечисления.ДействияСинхронизацииТорговыеПредложения.Удаление;
				МенеджерЗаписи.Состояние             = Перечисления.СостоянияСинхронизацииТорговыеПредложения.ТребуетсяСинхронизация;
				МенеджерЗаписи.ДатаСинхронизации     = '00010101';
				МенеджерЗаписи.Записать();
			КонецЕсли;
		ИначеЕсли Публиковать Тогда
			МенеджерЗаписи.ТорговоеПредложение = Источник;
			МенеджерЗаписи.Организация         = Организация;
			МенеджерЗаписи.Состояние = Перечисления.СостоянияСинхронизацииТорговыеПредложения.ТребуетсяСинхронизация;
			МенеджерЗаписи.ДействиеСинхронизации = ?(ЕстьЗапись,
				Перечисления.ДействияСинхронизацииТорговыеПредложения.Изменение,
				Перечисления.ДействияСинхронизацииТорговыеПредложения.Добавление);
			МенеджерЗаписи.Записать(ЕстьЗапись);
		КонецЕсли;
		
		Если ЭлементСостояниеОбмена <> Неопределено И (ЕстьЗапись ИЛИ Публиковать) Тогда
			ЭлементСостояниеОбмена.Заголовок = Строка(МенеджерЗаписи.Состояние);
			ЭлементСостояниеОбмена.ЦветТекста = ЦветаСтиля.ЦветГиперссылкиБЭД;
			ЭлементСостояниеОбмена.Гиперссылка     = Истина;
			ЭлементНастройкиПубликации.Видимость   = Не ПустаяСтрока(Статус) И Публиковать;
			ЭлементСостояниеОбмена.Доступность     = Истина;
			ЭлементНастройкиПубликации.Доступность = Истина;
			ЭлементПозицииТорговогоПредложения.Видимость   = Не ПустаяСтрока(Статус) И Публиковать;
			ЭлементПозицииТорговогоПредложения.Доступность = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Подсказки

// Обработчик создания подсказок формы.
//
// Параметры:
//  Форма           - ФормаКлиентскогоПриложения - форма, в которой создаются подсказки.
//  ГруппаЭлементов - ГруппаЭлементов            - группа элементов формы, в которой размещаются подсказки.
//
Процедура ПриСозданииПодсказокФормы(Форма, ГруппаЭлементов) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОбменБизнесСеть") Тогда
		Возврат;
	КонецЕсли;
	
	// Добавление реквизита формы для хранения подсказки.
	Картинка = Форма.Элементы.Добавить("Подключаемый_КартинкаТорговыеПредложения", Тип("ДекорацияФормы"), ГруппаЭлементов);
	Картинка.Вид       = ВидДекорацииФормы.Картинка;
	Картинка.Картинка  = БиблиотекаКартинок.Идея;
	Картинка.Видимость = Ложь;
	
	Декорация = Форма.Элементы.Добавить("Подключаемый_ПодсказкаТорговыеПредложения", Тип("ДекорацияФормы"), ГруппаЭлементов);
	Декорация.АвтоМаксимальнаяШирина = Ложь;
	Декорация.УстановитьДействие("Нажатие", "Подключаемый_ПодсказкиБизнесСетьНажатие");
	Декорация.Гиперссылка = Истина;
	Декорация.Видимость   = Ложь;
	
	НовыйРеквизит = Новый РеквизитФормы("Подключаемый_ТорговыеПредложенияПодсказка",
		Новый ОписаниеТипов("Неопределено"),, НСтр("ru = 'Подсказка торговых предложений'"));
	
	// Добавление реквизита формы для хранения подсказки.
	НовыеРеквизитыФормы = Новый Массив;
	НовыеРеквизитыФормы.Добавить(НовыйРеквизит);
	Форма.ИзменитьРеквизиты(НовыеРеквизитыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиПубликации

// Сведения о публикации торгового предложения.
//
// Параметры:
//  ТорговоеПредложение	 - Ссылка - ссылка на торговое предложение.
// 
// Возвращаемое значение:
//  Структура - значения дополнительных настроек.
//   * Организация - Ссылка - организация настройки.
//   * АдресЭлектроннойПочты - Строка - адрес электронной почты поставщика.
//   * Организация - Ссылка - организация настройки.
//   * УведомлятьОЗаказах - Булево - признак уведомления о получении заказов покупателей.
//   * ПубликоватьЦены - Булево - публиковать цены.
//   * ПубликоватьСрокиПоставки - Булево - публиковать сроки поставки.
//   * ПубликоватьОстатки - Булево - публиковать остатки.
//   * ДополнительноеОписание - Строка - дополнительное текстовое описание.
//
Функция НастройкиПубликации(ТорговоеПредложение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СостоянияСинхронизацииТорговыеПредложения.Организация КАК Организация,
	|	СостоянияСинхронизацииТорговыеПредложения.АдресЭлектроннойПочты КАК АдресЭлектроннойПочты,
	|	СостоянияСинхронизацииТорговыеПредложения.УведомлятьОЗаказах КАК УведомлятьОЗаказах,
	|	СостоянияСинхронизацииТорговыеПредложения.ПубликоватьЦены КАК ПубликоватьЦены,
	|	СостоянияСинхронизацииТорговыеПредложения.ПубликоватьСрокиПоставки КАК ПубликоватьСрокиПоставки,
	|	СостоянияСинхронизацииТорговыеПредложения.ПубликоватьОстатки КАК ПубликоватьОстатки,
	|	СостоянияСинхронизацииТорговыеПредложения.ДополнительноеОписание КАК ДополнительноеОписание
	|ИЗ
	|	РегистрСведений.СостоянияСинхронизацииТорговыеПредложения КАК СостоянияСинхронизацииТорговыеПредложения
	|ГДЕ
	|	СостоянияСинхронизацииТорговыеПредложения.ТорговоеПредложение = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТорговоеПредложение);
	
	УстановитьПривилегированныйРежим(Истина);
	Таблица = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Таблица.Количество() Тогда
		Результат = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Таблица[0]);
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПраваДоступа

// Проверяет возможность настройки торговых предложений в сервисе 1С:Бизнес-сеть для текущего пользователя.
//
// Параметры:
//  ВыводитьСообщение - Булево - признак вывода сообщений пользователю при отсутствии доступа.
// 
// Возвращаемое значение:
//  Булево - наличие права на настройку обмена документами.
//
Функция ПравоНастройкиТорговыхПредложений(ВыводитьСообщение = Ложь) Экспорт
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат Истина;
	КонецЕсли;
	
	ЕстьПраво = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.СостоянияСинхронизацииТорговыеПредложения);
	
	Если Не ЕстьПраво И ВыводитьСообщение Тогда
		ЭлектронноеВзаимодействиеСлужебный.СообщитьПользователюОНарушенииПравДоступа();
	КонецЕсли;
	
	Возврат ЕстьПраво;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область НастройкиПодсказок

Функция ПоказыватьПодсказкиПоставщиков() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Константы.ПоказыватьПодсказкиПоставщиковБизнесСеть.Получить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ПоказыватьПодсказкиПокупателей() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Константы.ПоказыватьПодсказкиПокупателейБизнесСеть.Получить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ПоказыватьПодсказкиПоставщиковУстановить(Значение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Константы.ПоказыватьПодсказкиПоставщиковБизнесСеть.Установить(Значение);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

Процедура ПоказыватьПодсказкиПокупателейУстановить(Значение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Константы.ПоказыватьПодсказкиПокупателейБизнесСеть.Установить(Значение);
	
	УстановитьПривилегированныйРежим(Ложь);
		
КонецПроцедуры

#КонецОбласти

// Получение подсказки по контексту в фоновом задании.
//
// Параметры:
//  ДанныеКонтекста	 - Структура - контекст данных формы для подсказок,
//    см. ТорговыеПредложенияКлиент.ДанныеКонтекстаДляПодсказки.
//  АдресРезультата - Строка - адрес временного хранилища, в которое будет
//                             помещен (или уже помещен) результат работы процедуры.
// 
// Возвращаемое значение:
//  Структура - данные подсказок, см. ОписаниеПодсказокСервиса.
//
Функция ПолучитьПодсказкуПоКонтексту(ДанныеКонтекста, Знач АдресРезультата) Экспорт
	
	Если Не БизнесСеть.ПравоЧтенияНастроекОбменаДокументами() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Подсказки = ОписаниеПодсказокСервиса();
	
	// Заполнение роли пользователя.
	ПодсказкаXDTO = ФабрикаXDTO.Создать(ТипXDTO("HintRequest"));
	Если ДанныеКонтекста.РежимПоставщика Тогда
		ПодсказкаXDTO.role = "shipper";
	ИначеЕсли ДанныеКонтекста.РежимПокупателя Тогда
		ПодсказкаXDTO.role = "customer";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	// Показ контекстной подсказки из документов производится только при включенной опции
	// показа подсказок для покупателей.
	ПоказыватьПодсказкиПокупателей = ПоказыватьПодсказкиПокупателей();
	
	Если ДанныеКонтекста.РежимПокупателя 
		И (ДанныеКонтекста.РежимПоискаПоСписку ИЛИ ДанныеКонтекста.РежимПоискаПоОтборам)
		И Не ПоказыватьПодсказкиПокупателей Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Заполнение данных по организациям.
	Если ДанныеКонтекста.Организации.Количество() Тогда
		
		// Проверка регистрации организации в сервисе.
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ОрганизацииБизнесСеть.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.ОрганизацииБизнесСеть КАК ОрганизацииБизнесСеть
		|ГДЕ
		|	ОрганизацииБизнесСеть.Организация В(&СписокОрганизаций)";
		Запрос.УстановитьПараметр("СписокОрганизаций", ДанныеКонтекста.Организации);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() <> ДанныеКонтекста.Организации.Количество() Тогда
			// Не все организации контекста зарегистрированы в сервисе, подсказка не отображается.
			Возврат Неопределено;
		КонецЕсли;
		
		// Заполнение данных по организации.
		Для каждого Организация Из ДанныеКонтекста.Организации Цикл
			РеквизитыОрганизации = Неопределено; 
			ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(Организация, РеквизитыОрганизации);
			ОрганизацияXDTO = ФабрикаXDTO.Создать(ТипXDTO("Organization"));
			
			Отказ = Ложь;
			Идентификаторы = БизнесСеть.ИдентификаторыУчастника(РеквизитыОрганизации.ИНН, РеквизитыОрганизации.КПП,, Отказ);
			Если Отказ Тогда
				Продолжить;
			КонецЕсли;
			
			ОрганизацияXDTO.inn = Идентификаторы.ИНН;
			ОрганизацияXDTO.kpp = Идентификаторы.КПП;
			ПодсказкаXDTO.organizations.Добавить(ОрганизацияXDTO);
		КонецЦикла;
		
	Иначе
		// Получение всех зарегистрированных организаций.
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОрганизацииБизнесСеть.Организация КАК Ссылка
		|ИЗ
		|	РегистрСведений.ОрганизацииБизнесСеть КАК ОрганизацииБизнесСеть";
		
		СписокОрганизаций = Запрос.Выполнить().Выгрузить();
		БизнесСеть.ЗаполнитьРеквизитыОрганизаций(СписокОрганизаций);
		
		Для каждого РеквизитыОрганизации Из СписокОрганизаций Цикл
			
			ОрганизацияXDTO = ФабрикаXDTO.Создать(ТипXDTO("Organization"));
			
			Отказ = Ложь;
			Идентификаторы = БизнесСеть.ИдентификаторыУчастника(РеквизитыОрганизации.ИНН, РеквизитыОрганизации.КПП,, Отказ);
			Если Отказ Тогда
				Продолжить;
			КонецЕсли;
			
			ОрганизацияXDTO.inn = Идентификаторы.ИНН;
			ОрганизацияXDTO.kpp = Идентификаторы.КПП;
			
			ПодсказкаXDTO.organizations.Добавить(ОрганизацияXDTO);
			
		КонецЦикла;
	КонецЕсли;
	
	// Подготовка данных по объекту.
	Если ЗначениеЗаполнено(ДанныеКонтекста.Основание) Тогда
		
		// Валюта.
		Валюта = Неопределено; ВалютаКод = "";
		ТорговыеПредложенияПереопределяемый.ПолучитьВалютуРегламентированногоУчета(Валюта);
		Если ЗначениеЗаполнено(Валюта) Тогда
			ВалютаКод = ТорговыеПредложенияПовтИсп.КодВалюты(Валюта);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ВалютаКод) Тогда
			ЭлектронноеВзаимодействие.ОбработатьОшибку(НСтр("ru = 'Получение подсказки торговых предложений.'"),
				НСтр("ru = 'Ошибка получения валюты или кода валюты.'"),, "БизнесСеть");
			Отказ = Истина;
			Возврат Неопределено;
		КонецЕсли;
		
		Если ДанныеКонтекста.РежимПоискаПоСписку Тогда
			
			ПоискXDTO = ФабрикаXDTO.Создать(ТипXDTO("ProductListSearch"));
			ПоискXDTO.currency = ВалютаКод;
			
			// Список товаров для поиска.
			ПараметрыПоиска = Новый Структура;
			ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыПоиска, СохраненныеНастройкиПоискаПоТоварам());
			Товары = ОписаниеТаблицыТоваровДляПоиска();
			ТорговыеПредложенияПереопределяемый.ПолучитьТоварыДляПодсказокПоСсылке(
				ДанныеКонтекста.Основание, ПараметрыПоиска.ПоискПоШтрихКоду, Товары);
			ПараметрыПоиска.Вставить("Товары", Товары);
			СписокТоваровXDTO = ТоварыДляПоискаПоСпискуXDTO(ПараметрыПоиска);
			
			// Если список товаров пустой, прерывание.
			Если СписокТоваровXDTO.Количество() = 0 Тогда
				Возврат Неопределено;
			КонецЕсли;
			
			Для каждого СтрокаТовара Из СписокТоваровXDTO Цикл
				ПоискXDTO.listSearch.Добавить(СтрокаТовара);
			КонецЦикла;
						
			// Заполнение списка поиска.
			ПодсказкаXDTO.productListSearch = ПоискXDTO;
			
		ИначеЕсли ДанныеКонтекста.РежимПоискаПоОтборам Тогда
			
			ПоискXDTO = ФабрикаXDTO.Создать(ТипXDTO("ProductSearch"));
			ПоискXDTO.currency = ВалютаКод;
			
			Товары = ОписаниеТаблицыТоваровДляПоиска();
			ТорговыеПредложенияПереопределяемый.ПолучитьТоварыДляПодсказокПоСсылке(ДанныеКонтекста.Основание, Истина, Товары);
			Если Не Товары.Количество() Тогда
				Возврат Неопределено;
			КонецЕсли;
			
			ПоискXDTO.productName = Товары[0].Наименование;
			ПоискXDTO.vendorCode  = Товары[0].Артикул;
			Для каждого ЗначениеМассива Из Товары[0].Штрихкоды Цикл
				ПоискXDTO.barcodes.Добавить(ЗначениеМассива);
			КонецЦикла;
			
			ПодсказкаXDTO.productSearch = ПоискXDTO;
			
			// Дополнительные параметры для открытия поиска по отборам.
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ОтборНаименование", Товары[0].Наименование);
			ДополнительныеПараметры.Вставить("ОтборАртикул",      Товары[0].Артикул);
			ДополнительныеПараметры.Вставить("ОтборШтрихкоды",    Товары[0].Штрихкоды);
			Подсказки.ДополнительныеПараметры = ДополнительныеПараметры;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Выполнение запроса к сервису.
	Отказ = Ложь;
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("Данные",  ОбъектXDTOВСтрокуJSON(ПодсказкаXDTO));
	ПараметрыКоманды = ПараметрыКомандыПолучитьПодсказку(ПараметрыМетода);
	Результат = БизнесСеть.ВыполнитьКомандуСервиса(ПараметрыКоманды, Отказ);
	Если Отказ ИЛИ Не ЗначениеЗаполнено(Результат) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Подсказки, Результат, "Код, Заголовок, Содержание");
	
	// Преобразование значений доступных действий.
	Если ТипЗнч(Результат.Действия) = Тип("Массив") Тогда
		Для каждого Действие Из Результат.Действия Цикл
			Если ВРег(Действие) = "REGISTRATION" Тогда
				Подсказки.Действия.Добавить("Регистрация");
			ИначеЕсли ВРег(Действие) = "PRODUCT_PUBLICATION" Тогда
				Подсказки.Действия.Добавить("ПубликацияТорговыхПредложений");
			ИначеЕсли ВРег(Действие) = "BARCODE_UPLOAD" Тогда
				Подсказки.Действия.Добавить("ВыгрузкаШтрихкодов");
			ИначеЕсли ВРег(Действие) = "INVITE_ORG" Тогда
				Подсказки.Действия.Добавить("ОтправкаПриглашений");
			ИначеЕсли ВРег(Действие) = "PRODUCT_SEARCH" Тогда
				Подсказки.Действия.Добавить("ПоискПоОтборам");
			ИначеЕсли ВРег(Действие) = "PRODUCT_LIST_SEARCH" Тогда
				Подсказки.Действия.Добавить("ПоискПоТоварам");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Сохранение подсказки по временное хранилище.
	ПоместитьВоВременноеХранилище(Подсказки, АдресРезультата);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ТорговыеПредложения

Функция ПараметрыКомандыВыгрузкаШтрихкодовДляПодсказок(ПараметрыМетода, Отказ)

	ПараметрыКоманды = БизнесСеть.ОписаниеПараметровКомандыСервиса();
	
	ПараметрыКоманды.ИдентификаторОрганизации = БизнесСеть.ИдентификаторОрганизации(ПараметрыМетода.Организация);
	
	РеквизитыОрганизации = Неопределено;
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ПараметрыМетода.Организация, РеквизитыОрганизации);
	
	ТекстОшибки = "";
	Идентификаторы = БизнесСеть.ИдентификаторыУчастника(РеквизитыОрганизации.ИНН, РеквизитыОрганизации.КПП,
		ПараметрыМетода.Организация, Отказ, ТекстОшибки);
	Если Отказ Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка выгрузки штрихкодов для подсказок:'") + " " + ТекстОшибки;
	КонецЕсли;

	ПараметрыКоманды.Адрес = СтрШаблон("/api/offer/v1/organization/%1/%2/barcode/fullSync",
		Идентификаторы.ИНН, Идентификаторы.КПП);
		
	ПараметрыКоманды.Наименование = НСтр("ru = 'Выгрузка штрихкодов номенклатуры'");
	ПараметрыКоманды.Метод = "POST";
	ПараметрыКоманды.Права = "bn_user";
	ПараметрыКоманды.Данные = ПараметрыМетода.Данные;
	ПараметрыКоманды.Ошибки.Вставить(400, НСтр("ru = 'Ошибка выгрузки штрихкодов номенклатуры.'"));
	Возврат ПараметрыКоманды;

КонецФункции

Функция ПараметрыКомандыПолучитьПодсказку(ПараметрыМетода)

	ПараметрыКоманды = БизнесСеть.ОписаниеПараметровКомандыСервиса();

	ПараметрыКоманды.Наименование = НСтр("ru = 'Получение подсказок'");
	ПараметрыКоманды.Адрес  = "/api/offer/v1/hint";
	ПараметрыКоманды.Метод  = "POST";
	ПараметрыКоманды.Права  = "bn_user";
	ПараметрыКоманды.Данные = ПараметрыМетода.Данные;
	ПараметрыКоманды.Аутентификация = Ложь;
	
	ПараметрыКоманды.Ошибки.Вставить(404, НСтр("ru = 'Организация не найдена в сервисе.'"));
	ПараметрыКоманды.Ошибки.Вставить(403, НСтр("ru = 'Недостаточно прав на организацию.'"));
	ПараметрыКоманды.Ошибки.Вставить(400, НСтр("ru = 'Ошибка параметров.'"));
	ПараметрыКоманды.БлокироватьСообщенияОбОшибках = Истина;
	
	ОбработкаРезультата = Новый Структура;
	ОбработкаРезультата.Вставить("Код",        "code");
	ОбработкаРезультата.Вставить("Заголовок",  "shortText");
	ОбработкаРезультата.Вставить("Содержание", "longText");
	ОбработкаРезультата.Вставить("Действия",   "actions");
	
	ПараметрыКоманды.Вставить("ОбработкаРезультата", ОбработкаРезультата);
	
	Возврат ПараметрыКоманды;

КонецФункции

#КонецОбласти

#Область ОписаниеПараметров

// Описание реквизитов номенклатуры.
//
// Возвращаемое значение:
//  Структура - описание реквизитов.
//
Функция НовыйПараметрыНоменклатуры() Экспорт
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("ИспользованиеХарактеристик");
	Реквизиты.Вставить("ЕдиницаИзмерения");
	Реквизиты.Вставить("Упаковка");

	Возврат Реквизиты;
	
КонецФункции

// Описание настроек поиска по товарам
// 
// Возвращаемое значение:
//  Структура - описание структуры для хранения настроек поиска по товарам.
//
Функция ОписаниеНастроекПоискаПоТоварам()
	
	Результат = Новый Структура;
	Результат.Вставить("ПревышениеМинимальнойЦены",     25);
	Результат.Вставить("МаксимальныйСрокПоставки",       7);
	Результат.Вставить("ОграничениеТорговыхПредложений", 5);
	Результат.Вставить("ПоискПоНаименованию",        Ложь);
	Результат.Вставить("ПоискПоХарактеристике",      Ложь);
	Результат.Вставить("ПоискПоАртикулу",            Ложь);
	Результат.Вставить("ПоискПоШтрихКоду",           Истина);
	Результат.Вставить("ПоискПоНоменклатуреСервиса", Истина);
	
	Возврат Результат;
	
КонецФункции

// Описание подсказок сервиса.
// 
// Возвращаемое значение:
//  Структура - описание данных для подсказок.
//
Функция ОписаниеПодсказокСервиса()
	
	Подсказки = Новый Структура;
	Подсказки.Вставить("Код",        "");
	Подсказки.Вставить("Заголовок",  "");
	Подсказки.Вставить("Содержание", "");
	Подсказки.Вставить("ДействиеРегистрация", Ложь);
	Подсказки.Вставить("ДействиеПубликация",  Ложь);
	Подсказки.Вставить("ДействиеВыгрузка",    Ложь);
	Подсказки.Вставить("ДействиеПриглашение", Ложь);
	Подсказки.Вставить("ДействиеПоиск",       Ложь);
	Подсказки.Вставить("Действия",            Новый Массив); // Массив действий.
	Подсказки.Вставить("ДополнительныеПараметры", Новый Структура); // Массив действий.
	Подсказки.Вставить("Основание",           Неопределено); // Заполняется по контексту формы.
	Подсказки.Вставить("РежимПоставщика",     Ложь); // Заполняется по контексту формы.
	Подсказки.Вставить("РежимПокупателя",     Ложь); // Заполняется по контексту формы.
	
	Возврат Подсказки;
	
КонецФункции

// Описание таблицы товаров для поиска.
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица товаров для поиска:
//   * Номенклатура        - Ссылка - номенклатура.
//   * Характеристика      - Ссылка - характеристика.
//   * Упаковка            - Ссылка - упаковка.
//   * Количество          - Число - количество товара.
//   * УпаковкаКод         - Строка - код упаковки по классификатору ОКЕИ.
//   * ЕдиницаИзмеренияКод - Строка - код единицы измерений по классификатору ОКЕИ.
//   * УпаковкаЧислитель   - Число - числитель упаковки по отношению к единице измерения.
//   * УпаковкаЗнаменатель - Знаменатель - знаменатель упаковки по отношению к единице измерения.
//   * Артикул             - Строка - артикул товара.
//   * Наименование        - Строка - наименование товара.
//   * Штрихкоды           - Массив из Строка - штрихкоды товара
//
Функция ОписаниеТаблицыТоваровДляПоиска()
	
	Товары = Новый ТаблицаЗначений;
	Товары.Колонки.Добавить("Номенклатура",        Справочники.ТипВсеСсылки());
	Товары.Колонки.Добавить("Характеристика",      Справочники.ТипВсеСсылки());
	Товары.Колонки.Добавить("Упаковка",            Справочники.ТипВсеСсылки());
	Товары.Колонки.Добавить("Количество",          Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("УпаковкаКод",         Новый ОписаниеТипов("Строка"));
	Товары.Колонки.Добавить("ЕдиницаИзмеренияКод", Новый ОписаниеТипов("Строка"));
	Товары.Колонки.Добавить("УпаковкаЧислитель",   Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("УпаковкаЗнаменатель", Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("Артикул",             Новый ОписаниеТипов("Строка"));
	Товары.Колонки.Добавить("Наименование",        Новый ОписаниеТипов("Строка"));
	Товары.Колонки.Добавить("Штрихкоды",           Новый ОписаниеТипов("Массив"));
	
	Возврат Товары;
	
КонецФункции

#КонецОбласти

#Область ПреобразованиеДанных

// Получение значение JSON простого типа (строка, число, дата, булево).
//
// Параметры:
//  Значение - Произвольный - значение преобразования.
// 
// Возвращаемое значение:
//  Строка, Число, Дата, Булево - преобразованное значение.
//
Функция ЗначениеJSON(Знач Значение)
	
	Если ТипЗнч(Значение) = Тип("Дата") Тогда
		Значение = Формат(Значение, "ДФ=yyyy-MM-dd; ДП=null");
	ИначеЕсли ТипЗнч(Значение) = Тип("Число") И Значение = 0 Тогда
		Значение = Строка(Значение);
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

// Чтение значения объекта XTDO в запись JSON.
//
// Параметры:
//  ОбъектXDTO	 - Произвольный - элемент XDTO.
//  ЗаписьJSON	 - ЗаписьJSON - запись JSON.
//  Уровень		 - Число - уровень вложенности.
//
Процедура ПрочитатьОбъектXDTOВЗаписьJSON(Знач ОбъектXDTO, ЗаписьJSON, Знач Уровень = 0)
	
	Если ТипЗнч(ОбъектXDTO) = Тип("СписокXDTO") Тогда
		Если ОбъектXDTO.Количество() Тогда
			Если Уровень > 0 Тогда
				ЗаписьJSON.ЗаписатьИмяСвойства(ОбъектXDTO.ВладеющееСвойство.Имя);
			КонецЕсли;
			ЗаписьJSON.ЗаписатьНачалоМассива();
			Для каждого ЭлементСпискаXDTO Из ОбъектXDTO Цикл
				ПрочитатьОбъектXDTOВЗаписьJSON(ЭлементСпискаXDTO, ЗаписьJSON, Уровень);
			КонецЦикла;
			ЗаписьJSON.ЗаписатьКонецМассива();
		Иначе
			ЗаписьJSON.ЗаписатьНачалоМассива();
			ЗаписьJSON.ЗаписатьКонецМассива();
		КонецЕсли;
	ИначеЕсли ТипЗнч(ОбъектXDTO) = Тип("ОбъектXDTO") Тогда
		Если Уровень > 0 Или ОбъектXDTO.Свойства().Количество() > 1 Тогда
			ЗаписьJSON.ЗаписатьНачалоОбъекта();
		КонецЕсли;
		Для каждого СвойствоXDTO Из ОбъектXDTO.Свойства() Цикл
			Если ТипЗнч(ОбъектXDTO[СвойствоXDTO.Имя]) = Тип("СписокXDTO") Тогда
				Если СвойствоXDTO.НижняяГраница > 0 
					ИЛИ ОбъектXDTO[СвойствоXDTO.Имя].Количество() <> 0 
					ИЛИ Уровень = -1 Тогда
					ПрочитатьОбъектXDTOВЗаписьJSON(ОбъектXDTO.ПолучитьСписок(СвойствоXDTO.Имя), ЗаписьJSON, Уровень + 1);
				КонецЕсли;
			ИначеЕсли ТипЗнч(ОбъектXDTO[СвойствоXDTO.Имя]) = Тип("ОбъектXDTO") Тогда
				ЗаписьJSON.ЗаписатьИмяСвойства(СвойствоXDTO.Имя);
				ПрочитатьОбъектXDTOВЗаписьJSON(ОбъектXDTO.Получить(СвойствоXDTO.Имя), ЗаписьJSON, Уровень + 1);
			Иначе	
				ЗначениеСвойства = ЗначениеJSON(ОбъектXDTO.Получить(СвойствоXDTO.Имя));
				Если НЕ ЗначениеЗаполнено(ЗначениеСвойства) И СвойствоXDTO.НижняяГраница = 0 Тогда
					Продолжить;
				КонецЕсли;
				ЗаписьJSON.ЗаписатьИмяСвойства(СвойствоXDTO.Имя);	
				ЗаписьJSON.ЗаписатьЗначение(ЗначениеСвойства);
			КонецЕсли;
		КонецЦикла;
		Если Уровень > 0 Или ОбъектXDTO.Свойства().Количество() > 1 Тогда
			ЗаписьJSON.ЗаписатьКонецОбъекта();
		КонецЕсли;
	ИначеЕсли ТипЗнч(ОбъектXDTO) <> Неопределено Тогда
		ЗаписьJSON.ЗаписатьЗначение(ЗначениеJSON(ОбъектXDTO));
	КонецЕсли;
	
КонецПроцедуры

// Преобразование объекта XDTO в формат JSON.
//
// Параметры:
//  ОбъектXDTO	 - ОбъектXDTO - объект данных модели XDTO.
//  Уровень		 - Число - уровень вложенности.
// 
// Возвращаемое значение:
//  Строка - строка значения в формате JSON.
//
Функция ОбъектXDTOВСтрокуJSON(Знач ОбъектXDTO, Знач Уровень = 0)
	
	Если ОбъектXDTO = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ЗаписьJSON.УстановитьСтроку();
	
	ПрочитатьОбъектXDTOВЗаписьJSON(ОбъектXDTO, ЗаписьJSON, Уровень);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

#КонецОбласти

#Область ОбменДанными

// Тип XDTO.
//
// Параметры:
//  ИмяТипа	 - Строка - пространство имен.
// 
// Возвращаемое значение:
//  ТипЗначенияXDTO - тип XDTO по пространству имен.
//
Функция ТипXDTO(ИмяТипа)
	
	Возврат ФабрикаXDTO.Тип("http://1cbn.ru/offers/XMLSchema", ИмяТипа)
	
КонецФункции

// Выгрузка штрихкодов для получения подсказок сервиса 1С:Бизнес-сеть.
//
Процедура ОбновитьПодсказкиТорговыеПредложения()
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОбменБизнесСеть")
		Или Не ТорговыеПредложенияСлужебный.ИспользоватьФункционалПубликации() Тогда
		Возврат;
	КонецЕсли;
	
	// Выбрать подключенные организации к Бизнес-сети.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОрганизацииБизнесСеть.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.ОрганизацииБизнесСеть КАК ОрганизацииБизнесСеть";
	
	Организации = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация");
	
	// Сформировать таблицу штрихкодов в переопределяемом модуле.
	Штрихкоды = Новый ТаблицаЗначений;
	Штрихкоды.Колонки.Добавить("Организация");
	Штрихкоды.Колонки.Добавить("Штрихкод");
	Штрихкоды.Колонки.Добавить("Наименование");
	Штрихкоды.Колонки.Добавить("РежимПоставщика");
	Штрихкоды.Колонки.Добавить("РежимПокупателя");
	
	РежимПоставщика = ПоказыватьПодсказкиПоставщиков();
	РежимПокупателя = ПоказыватьПодсказкиПокупателей();
	
	ТорговыеПредложенияПереопределяемый.ЗаполнитьШтрихкодыДляВыгрузки(Организации, Истина, Истина, Штрихкоды);
	
	Если Штрихкоды.Количество() = 0 ИЛИ (РежимПоставщика = Ложь И РежимПокупателя = Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	// Выгрузка данных производится отдельно для каждой организации.
	Для каждого Организация Из Организации Цикл
		
		Отказ = Ложь;
		
		// Подготовить данные для запроса.
		ШтрихкодыXDTO = ФабрикаXDTO.Создать(ТипXDTO("ProductBarcodeList"));
		ШтрихкодыОрганизация = Штрихкоды.НайтиСтроки(Новый Структура("Организация", Организация));
		
		ТолькоПоставляется = 1;
		ТолькоЗакупается = 2;
		ПоставляетсяИЗакупается = 3;
		
		Для каждого СтрокаШтрихкода Из ШтрихкодыОрганизация Цикл
			
			СтрокаШтрихкодаXDTO = ФабрикаXDTO.Создать(ТипXDTO("ProductBarcode"));
			СтрокаШтрихкодаXDTO.barcode = СтрокаШтрихкода.Штрихкод;
			СтрокаШтрихкодаXDTO.productName = СтрокаШтрихкода.Наименование;
			Если СтрокаШтрихкода.РежимПоставщика И СтрокаШтрихкода.РежимПокупателя Тогда
				Если РежимПоставщика И РежимПокупателя = Ложь Тогда
					СтрокаШтрихкодаXDTO.type = ТолькоПоставляется;
				ИначеЕсли РежимПоставщика И РежимПокупателя = Истина Тогда
					СтрокаШтрихкодаXDTO.type = ТолькоЗакупается;
				Иначе
					СтрокаШтрихкодаXDTO.type = ПоставляетсяИЗакупается;
				КонецЕсли; 
			ИначеЕсли РежимПоставщика И СтрокаШтрихкода.РежимПоставщика
				И Не СтрокаШтрихкода.РежимПокупателя Тогда
				СтрокаШтрихкодаXDTO.type = ТолькоПоставляется;
			ИначеЕсли РежимПокупателя И Не СтрокаШтрихкода.РежимПоставщика И СтрокаШтрихкода.РежимПокупателя Тогда
				СтрокаШтрихкодаXDTO.type = ТолькоЗакупается;
			Иначе
				Продолжить;
			КонецЕсли;
			
			ШтрихкодыXDTO.ProductBarcodes.Добавить(СтрокаШтрихкодаXDTO);
			
		КонецЦикла;
		
		Данные = ОбъектXDTOВСтрокуJSON(ШтрихкодыXDTO, -1);
		ПараметрыМетода = Новый Структура("Организация, Данные", Организация, Данные);
		ПараметрыКоманды = ПараметрыКомандыВыгрузкаШтрихкодовДляПодсказок(ПараметрыМетода, Отказ);
		Если Отказ Тогда
			ВызватьИсключение НСтр("ru = 'Ошибка обновления подсказок торговых предложений'");
		КонецЕсли;

		БизнесСеть.ВыполнитьКомандуСервиса(ПараметрыКоманды, Отказ);
		Если Отказ Тогда
			ВызватьИсключение НСтр("ru = 'Ошибка обновления подсказок торговых предложений'");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Массив товаров для поиска
//
// Параметры:
//  ПараметрыПоиска	 - Структура - параметры поиска, см. ОписаниеНастроекПоискаПоТоварам.
// 
// Возвращаемое значение:
//  Массив - массив объектов XDTO для поиска.
//
Функция ТоварыДляПоискаПоСпискуXDTO(ПараметрыПоиска)
	
	МассивДанных = Новый Массив;
	
	Для каждого СтрокаТовары Из ПараметрыПоиска.Товары Цикл
		
		Если Не (ПараметрыПоиска.ПоискПоНаименованию И ЗначениеЗаполнено(СтрокаТовары.Наименование))
			И Не (ПараметрыПоиска.ПоискПоХарактеристике И ЗначениеЗаполнено(СтрокаТовары.Характеристика))
			И Не (ПараметрыПоиска.ПоискПоАртикулу И ЗначениеЗаполнено(СтрокаТовары.Артикул))
			И Не (ПараметрыПоиска.ПоискПоШтрихКоду И ТипЗнч(СтрокаТовары.ШтрихКоды) = Тип("Массив") И СтрокаТовары.ШтрихКоды.Количество()) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементПоиска = ФабрикаXDTO.Создать(ТипXDTO("ListSearch"));
		ЭлементПоиска.index = ПараметрыПоиска.Товары.Индекс(СтрокаТовары);
		
		Если ПараметрыПоиска.ПоискПоНаименованию И ЗначениеЗаполнено(СтрокаТовары.Наименование) Тогда
			ЭлементПоиска.Установить("productName", СтрокаТовары.Наименование);
		КонецЕсли;
		
		Если ПараметрыПоиска.ПоискПоХарактеристике И ЗначениеЗаполнено(СтрокаТовары.Характеристика) Тогда
			ЭлементПоиска.Установить("productFeature", Строка(СтрокаТовары.Характеристика));
		КонецЕсли;
		
		Если ПараметрыПоиска.ПоискПоАртикулу И ЗначениеЗаполнено(СтрокаТовары.Артикул) Тогда
			ЭлементПоиска.Установить("vendorCode", СтрокаТовары.Артикул);
		КонецЕсли;
		
		Если ПараметрыПоиска.ПоискПоШтрихКоду И ТипЗнч(СтрокаТовары.ШтрихКоды) = Тип("Массив") И СтрокаТовары.ШтрихКоды.Количество() Тогда
			Для каждого ЗначениеМассива Из СтрокаТовары.ШтрихКоды Цикл
				ЭлементПоиска.barcodes.Добавить(ЗначениеМассива);
			КонецЦикла;
		КонецЕсли;
		
		ОбъектЕдиницаИзмерения = ФабрикаXDTO.Создать(ТипXDTO("UnitFilter"));
		Если ЗначениеЗаполнено(СтрокаТовары.ЕдиницаИзмеренияКод) Тогда
			ОбъектЕдиницаИзмерения.basicUnit = СокрЛП(СтрокаТовары.ЕдиницаИзмеренияКод);
		ИначеЕсли ЗначениеЗаполнено(СтрокаТовары.УпаковкаКод) Тогда
			ОбъектЕдиницаИзмерения.basicUnit = СокрЛП(СтрокаТовары.УпаковкаКод);
		Иначе
			ОбъектЕдиницаИзмерения.basicUnit = "NULL";
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТовары.УпаковкаЧислитель) Тогда
			ОбъектЕдиницаИзмерения.basicUnitCount = СтрокаТовары.УпаковкаЧислитель;
		Иначе
			ОбъектЕдиницаИзмерения.basicUnitCount = 1;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТовары.УпаковкаЗнаменатель) Тогда
			ОбъектЕдиницаИзмерения.unitCount = СтрокаТовары.УпаковкаЗнаменатель;
		Иначе
			ОбъектЕдиницаИзмерения.unitCount = 1;
		КонецЕсли;
		ЭлементПоиска.units.Добавить(ОбъектЕдиницаИзмерения);
		ЭлементПоиска.buyingCount = СтрокаТовары.Количество * Макс(1, СтрокаТовары.УпаковкаЗнаменатель);
		
		МассивДанных.Добавить(ЭлементПоиска);
		
	КонецЦикла;
	
	Возврат МассивДанных;
		
КонецФункции

#КонецОбласти

#Область КонтактнаяИнформация

// Описание адресов абонента.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица для заполнения адресов:
//    * Представление - Строка - представление адреса.
//    * ЗначенияПолей - Строка - адрес в формате XML.
//    * Описание - Строка - комментарий адреса.
//    * Ссылка - Ссылка - объект хранения контактной информации.
//    * Вид - СправочникСсылка.ВидыКонтактнойИнформации - вид контактной информации.
//
Функция НовыйАдресАбонента() Экспорт
	
	АдресаАбонента = Новый ТаблицаЗначений;
	АдресаАбонента.Колонки.Добавить("Представление");
	АдресаАбонента.Колонки.Добавить("ЗначенияПолей");
	АдресаАбонента.Колонки.Добавить("Описание");
	АдресаАбонента.Колонки.Добавить("Ссылка");
	АдресаАбонента.Колонки.Добавить("Вид");
	
	Возврат АдресаАбонента;
	
КонецФункции

// Инициализация вида контактной информации для ввода адреса.
//
// Возвращаемое значение:
//  Структура - свойства для ввода адреса:
//    * Тип - ПеречислениеСсылка.ТипыКонтактнойИнформации - значения типа адрес.
//    * ВключатьСтрануВПредставление - Булево - признак включения страны в представление.
//
Функция ВидКонтактнойИнформацииАдреса() Экспорт
	
	ВидКонтактнойИнформации = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации();
	
	ВидКонтактнойИнформации.Вставить("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"));
	ВидКонтактнойИнформации.Вставить("ВключатьСтрануВПредставление", Истина);
	
	Возврат ВидКонтактнойИнформации;
	
КонецФункции

#КонецОбласти

#Область РегламентныеЗадания

// Выполняет регламентное задание по выгрузки штрихкодов для подсказок.
//
Процедура ОбновитьПодсказкиТорговыеПредложенияОбработчикЗадания() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.ОбновлениеПодсказокТорговыеПредложения);
		
	Если Не ВыгружатьШтрихкодыДляПодсказок() Тогда
		РегламентныеЗаданияСервер.УстановитьИспользованиеРегламентногоЗадания(
			Метаданные.РегламентныеЗадания.ОбновлениеПодсказокТорговыеПредложения, Ложь);
		Возврат;
	КонецЕсли;

	ПодсказкиДоступны = ПоказыватьПодсказкиПокупателей()
		Или ПоказыватьПодсказкиПоставщиков();
		
	Если ПолучитьФункциональнуюОпцию("ИспользоватьОбменБизнесСеть") И ПодсказкиДоступны Тогда
		ОбновлениеПодсказокТорговыхПредложений();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Настройки

// Сохраненные настройки поиска по товарам.
// 
// Возвращаемое значение:
//  Структура - сохраненные настройки поиска по товарам, см. ОписаниеНастроекПоискаПоТоварам.
//
Функция СохраненныеНастройкиПоискаПоТоварам() Экспорт
	
	// Заполнение структуры настроек по умолчанию.
	Результат = ОписаниеНастроекПоискаПоТоварам();
	
	// Чтение сохраненных данных.
	СохраненныеНастройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ТорговыеПредложения.ПоискПоТоварам",
		"НастройкиПоискаПоТоварам");
	Если ТипЗнч(СохраненныеНастройки) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Результат, СохраненныеНастройки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Сохранение настроек поиска по товарам.
//
// Параметры:
//  СохраняемыеНастройки - Структура - сохраняемые данные, см. ОписаниеНастроекПоискаПоТоварам.
//
Процедура СохранитьНастройкиПоискаПоТоварам(СохраняемыеНастройки) Экспорт
	
	Настройки = ОписаниеНастроекПоискаПоТоварам();
	
	Если ТипЗнч(СохраняемыеНастройки) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Настройки, СохраняемыеНастройки);
	КонецЕсли;

	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ТорговыеПредложения.ПоискПоТоварам",
		"НастройкиПоискаПоТоварам", Настройки);
		
КонецПроцедуры

#КонецОбласти

#Область Права

// Проверяет возможность поиска торговых предложений в сервисе 1С:Бизнес-сеть для текущего пользователя.
//
// Параметры:
//  ВыводитьСообщение - Булево - признак необходимости вывода сообщения о недостаточности прав.
// 
// Возвращаемое значение:
//  Булево - наличие права на выполнение обмена.
//
Функция ПравоПоискаТорговыхПредложений(ВыводитьСообщение = Ложь) Экспорт
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат Истина;
	КонецЕсли;
	
	ЕстьПраво = ПравоДоступа("Просмотр", Метаданные.ОбщиеКоманды.ТорговыеПредложенияБизнесСеть);
	
	Если Не ЕстьПраво И ВыводитьСообщение Тогда
		ЭлектронноеВзаимодействиеСлужебный.СообщитьПользователюОНарушенииПравДоступа();
	КонецЕсли;
	
	Возврат ЕстьПраво;
	
КонецФункции

// Проверяет возможность создания документа заказа поставщику для текущего пользователя.
//
// Параметры:
//  ВыводитьСообщение - Булево - признак необходимости вывода сообщения о недостаточности прав.
// 
// Возвращаемое значение:
//  Булево - наличие права на выполнение создание документа.
//
Функция ПравоСозданияЗаказовПоставщику(ВыводитьСообщение = Ложь) Экспорт
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат Истина;
	КонецЕсли;
	
	ЕстьПраво = Истина;
	ТекстСообщения = НСтр("ru = 'Недостаточно прав для создания документов заказа поставщику.'");
	
	ТорговыеПредложенияПереопределяемый.ПриОпределенииПраваСозданияЗаказовПоставщику(ЕстьПраво, ТекстСообщения);
	
	Если Не ЕстьПраво И ВыводитьСообщение Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат ЕстьПраво;
	
КонецФункции

#КонецОбласти

#Область Прочее

// Добавление элементов управления для формы торговые предложения.
//
// Параметры:
//  Форма           - ФормаКлиентскогоПриложения - форма объекта торговые предложения, например Справочник.Соглашения.
//  ГруппаЭлементов - ГруппаФормы                - группа элементов формы для добавления новых элементов.
//
Процедура ДобавитьЭлементыУправленияФормыТорговыеПредложения(Форма, ГруппаЭлементов)

	// Создание реквизитов формы.
	НовыеРеквизитыФормы = Новый Массив;
	РеквизитыФормы = Форма.ПолучитьРеквизиты();
	Реквизиты = Новый Соответствие;
	Для каждого РеквизитФормы Из РеквизитыФормы Цикл
		Реквизиты.Вставить(РеквизитФормы.Имя, РеквизитФормы);
	КонецЦикла;
	
	РеквизитТорговыеПредложенияПубликовать = Новый РеквизитФормы("ТорговыеПредложенияПубликовать",
		Новый ОписаниеТипов("Булево"),, НСтр("ru = 'Публиковать торговые предложения в сервисе'"),	Истина);
		
	Если Реквизиты.Получить(РеквизитТорговыеПредложенияПубликовать.Имя) = Неопределено Тогда
		НовыеРеквизитыФормы.Добавить(РеквизитТорговыеПредложенияПубликовать);
	КонецЕсли;
	Если НовыеРеквизитыФормы.Количество() Тогда
		Форма.ИзменитьРеквизиты(НовыеРеквизитыФормы);
	КонецЕсли;
	
	// Создание/настройка элементов управления.
	
	// Создание общей группы 1С:Бизнес-сеть.
	ЭлементГруппаТорговыеПредложения = ГруппаЭлементов.ПодчиненныеЭлементы.Найти("ГруппаТорговыеПредложения");
	Если ЭлементГруппаТорговыеПредложения = Неопределено Тогда
		ЭлементГруппаТорговыеПредложения = Форма.Элементы.Добавить("ГруппаТорговыеПредложения",
			Тип("ГруппаФормы"), ГруппаЭлементов);
		ЭлементГруппаТорговыеПредложения.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
		ЭлементГруппаТорговыеПредложения.Заголовок           = НСтр("ru = '1С:Бизнес-сеть'");
		ЭлементГруппаТорговыеПредложения.Отображение         = ОтображениеОбычнойГруппы.Нет;
		ЭлементГруппаТорговыеПредложения.ОтображатьЗаголовок = Ложь;
		ЭлементГруппаТорговыеПредложения.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	КонецЕсли;
	
	ЭлементыГруппы = ЭлементГруппаТорговыеПредложения.ПодчиненныеЭлементы;
	
	// Флаг Публиковать торговые предложения.
	ЭлементТорговыеПредложенияПубликовать = ЭлементыГруппы.Найти("ТорговыеПредложенияПубликовать");
	Если ЭлементТорговыеПредложенияПубликовать = Неопределено Тогда
		ЭлементТорговыеПредложенияПубликовать = Форма.Элементы.Добавить("ТорговыеПредложенияПубликовать",
			Тип("ПолеФормы"), ЭлементГруппаТорговыеПредложения);
		ЭлементТорговыеПредложенияПубликовать.Вид                = ВидПоляФормы.ПолеФлажка;
		ЭлементТорговыеПредложенияПубликовать.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		ЭлементТорговыеПредложенияПубликовать.ПутьКДанным        = РеквизитТорговыеПредложенияПубликовать.Имя;
		ЭлементТорговыеПредложенияПубликовать.УстановитьДействие("ПриИзменении",
			"Подключаемый_ПриИзменении_ПубликоватьТорговыеПредложения");
	КонецЕсли;
	
	// Создание группы Торговые предложения (состояние)
	ГруппаТорговыеПредложенияСостояние = ЭлементГруппаТорговыеПредложения.ПодчиненныеЭлементы.Найти("ГруппаТорговыеПредложенияСостояние");
	Если ГруппаТорговыеПредложенияСостояние = Неопределено Тогда
		ГруппаТорговыеПредложенияСостояние = Форма.Элементы.Добавить("ГруппаТорговыеПредложенияСостояние",
			Тип("ГруппаФормы"), ЭлементГруппаТорговыеПредложения);
		ГруппаТорговыеПредложенияСостояние.Вид                    = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаТорговыеПредложенияСостояние.Заголовок              = НСтр("ru = 'Состояние публикации'");
		ГруппаТорговыеПредложенияСостояние.Отображение            = ОтображениеОбычнойГруппы.Нет;
		ГруппаТорговыеПредложенияСостояние.ОтображатьЗаголовок    = Ложь;
		ГруппаТорговыеПредложенияСостояние.Группировка            = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ГруппаТорговыеПредложенияСостояние.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	КонецЕсли;
	
	ЭлементыГруппыСостояние = ГруппаТорговыеПредложенияСостояние.ПодчиненныеЭлементы;
	
	// Гиперссылка Торговые предложения.
	ЭлементТорговыеПредложенияСостояниеОбмена = ЭлементыГруппыСостояние.Найти("ТорговыеПредложенияСостояниеОбмена");
	Если ЭлементТорговыеПредложенияСостояниеОбмена = Неопределено Тогда
		ЭлементГиперссылка = Форма.Элементы.Добавить("ТорговыеПредложенияСостояниеОбмена",
			Тип("ДекорацияФормы"), ГруппаТорговыеПредложенияСостояние);
		ЭлементГиперссылка.Заголовок = НСтр("ru = 'Торговые предложения состояние обмена'");
		ЭлементГиперссылка.Гиперссылка = Истина;
		ЭлементГиперссылка.УстановитьДействие("Нажатие",
			"Подключаемый_Нажатие_ГиперссылкиТорговыхПредложений");
	КонецЕсли;
	
	// Гиперссылка Позиции.
	ЭлементГиперссылка = ЭлементыГруппыСостояние.Найти("ТорговыеПредложенияОткрытьПозицииТорговогоПредложения");
	Если ЭлементГиперссылка = Неопределено Тогда
		ЭлементГиперссылка = Форма.Элементы.Добавить("ТорговыеПредложенияОткрытьПозицииТорговогоПредложения",
			Тип("ДекорацияФормы"), ГруппаТорговыеПредложенияСостояние);
		ЭлементГиперссылка.Заголовок = НСтр("ru = '(список предложений)'");
		ЭлементГиперссылка.Гиперссылка = Истина;
		ЭлементГиперссылка.УстановитьДействие("Нажатие",
			"Подключаемый_Нажатие_ГиперссылкиТорговыхПредложений");
	КонецЕсли;
	
	// Гиперссылка Дополнительные настройки.
	ЭлементГиперссылка = ЭлементыГруппы.Найти("ТорговыеПредложенияОткрытьНастройкиПубликации");
	Если ЭлементГиперссылка = Неопределено Тогда
		ЭлементГиперссылка = Форма.Элементы.Добавить("ТорговыеПредложенияОткрытьНастройкиПубликации",
			Тип("ДекорацияФормы"), ЭлементГруппаТорговыеПредложения);
		ЭлементГиперссылка.Заголовок = НСтр("ru = 'Настройки публикации торгового предложения'");
		ЭлементГиперссылка.Гиперссылка = Истина;
		ЭлементГиперссылка.УстановитьДействие("Нажатие",
			"Подключаемый_Нажатие_ГиперссылкиТорговыхПредложений");
	КонецЕсли;

КонецПроцедуры


// Обновление подсказок торговых предложений торговых предложений в сервисе 1С:Бизнес-сеть.
//
Процедура ОбновлениеПодсказокТорговыхПредложений()
	
	ОбновитьПодсказкиТорговыеПредложения();
	
КонецПроцедуры

Функция ВыгружатьШтрихкодыДляПодсказок()
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#КонецОбласти
