
#Область ПрограммныйИнтерфейс

// Обработчик события вызывается при получении имени кассира.
//
// Параметры:
//  ИмяКассира - Строка, Неопределено - Текст, используемый для заполнения документа
//  СтандартнаяОбработка - Булево
//
Процедура ОбработкаЗаполненияИмяКассира(ИмяКассира, СтандартнаяОбработка) Экспорт
	
	//++ НЕ ГОСИС
	
	ИмяКассира = РозничныеПродажиВызовСервера.РеквизитыКассира().Наименование;
	СтандартнаяОбработка = Ложь;
	
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Обработчик события вызывается при получении ИНН кассира.
//
// Параметры:
//  ИННКассира - Строка, Неопределено - Текст, используемый для заполнения документа
//  СтандартнаяОбработка - Булево
//
Процедура ОбработкаЗаполненияИННКассира(ИННКассира, СтандартнаяОбработка) Экспорт
	
	//++ НЕ ГОСИС
	
	ИННКассира = РозничныеПродажиВызовСервера.РеквизитыКассира().ИНН;
	СтандартнаяОбработка = Ложь;
	
	//-- НЕ ГОСИС
	
КонецПроцедуры

#КонецОбласти