
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.ТекущаяСтрока = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя", Параметры.ТекущаяСтрока);
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СправочникИдентификаторыОбъектовМетаданных.Ссылка КАК Ссылка,
	|	СправочникИдентификаторыОбъектовМетаданных.ПометкаУдаления КАК ПометкаУдаления,
	|	СправочникИдентификаторыОбъектовМетаданных.Родитель КАК Родитель,
	|	СправочникИдентификаторыОбъектовМетаданных.Наименование КАК Наименование,
	|	СправочникИдентификаторыОбъектовМетаданных.ПорядокКоллекции КАК ПорядокКоллекции,
	|	СправочникИдентификаторыОбъектовМетаданных.Имя КАК Имя,
	|	СправочникИдентификаторыОбъектовМетаданных.Синоним КАК Синоним,
	|	СправочникИдентификаторыОбъектовМетаданных.ПолноеИмя КАК ПолноеИмя,
	|	СправочникИдентификаторыОбъектовМетаданных.ПолныйСиноним КАК ПолныйСиноним,
	|	СправочникИдентификаторыОбъектовМетаданных.БезДанных КАК БезДанных,
	|	СправочникИдентификаторыОбъектовМетаданных.ЗначениеПустойСсылки КАК ЗначениеПустойСсылки,
	|	СправочникИдентификаторыОбъектовМетаданных.КлючОбъектаМетаданных КАК КлючОбъектаМетаданных,
	|	СправочникИдентификаторыОбъектовМетаданных.НоваяСсылка КАК НоваяСсылка,
	|	СправочникИдентификаторыОбъектовМетаданных.Предопределенный КАК Предопределенный,
	|	СправочникИдентификаторыОбъектовМетаданных.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК СправочникИдентификаторыОбъектовМетаданных";
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.ОсновнаяТаблица = "Справочник.ИдентификаторыОбъектовМетаданных";
	СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.СписокИдентификаторов, СвойстваСписка); 
	
КонецПроцедуры

#КонецОбласти